tap "asmvik/formulae"
tap "barutsrb/tap", "https://github.com/BarutSRB/homebrew-tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "hashicorp/tap"
tap "modem-dev/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "theboredteam/boring-notch"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# VPN client
cask "amneziavpn"
# Replacement for the built-in Cmd+Tab app switcher
cask "bettercmdtab"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch", trusted: true
# Web browser focusing on privacy
cask "brave-browser"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source keystroke visualiser
cask "keycastr"
# Use Vim in input fields and non input fields
cask "kindavim"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Official Nextcloud Talk Desktop client
cask "nextcloud-talk"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Tiling window manager for macOS with Niri-inspired column-based layout
cask "barutsrb/tap/omniwm", trusted: true
# Document editor
cask "onlyoffice"
# Whisper dictation/transcription app
cask "opensuperwhisper"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist-app"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "Happ", id: 6504287215
mas "Hidden Bar", id: 1452453066
mas "uBlock Origin Lite", id: 6745342698
mas "Vimari", id: 1480933944
npm "@earendil-works/pi-coding-agent"
npm "@fission-ai/openspec"
npm "corepack"
